package org.kniit.lab6.task10;

import java.util.Random;

public class RandomWords {
    private String[] words = {"вселенная",
        "квантовый",
        "бесконечность",
        "созвездие",
        "гравитация",
        "спираль",
        "эфир",
        "сингулярность",
        "пульсар",
        "галактика",
        "сверкать",
        "шепот",
        "сумерки",
        "безмятежный",
        "хрустальный",
        "мерцание",
        "таинственный",
        "сияние",
        "прозрачный",
        "отражение",
        "эволюция",
        "синтез",
        "анализировать",
        "гипотеза",
        "парадокс",
        "интуиция",
        "феномен",
        "структура",
        "интерпретация",
        "критерий",
        "вдохновение",
        "воспоминание",
        "гармония",
        "изысканный",
        "ностальгия",
        "впечатление",
        "восторг",
        "уязвимый",
        "эфемерный",
        "созерцание",
        "механизм",
        "калейдоскоп",
        "лабиринт",
        "воронка",
        "маховик",
        "шестеренка",
        "портал",
        "конструкция",
        "алгоритм",
        "интерактивный" };
    private Random random = new Random();

    public String getRandomWord(){
        return words[random.nextInt(words.length)];
    }
}
